; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v12 ?v1)
             (pred_3 ?v10 ?v8)
             (pred_2 ?v12 ?v8)
             (pred_10 ?v7 ?v12 )
	     (pred_11 ?v12)
             (pred_6 ?v6)
             (pred_4 ?v10)
             (pred_9 ?v8)
             (pred_8 ?v12)
             (pred_5 ?v10)
             (pred_12 ?v12)
             (pred_7 ))



(:action op_2
:parameters (?v13 ?v4 ?v9 ?v11)
:precondition (and (pred_6 ?v13) (pred_6 ?v4) (pred_4 ?v9) (pred_9 ?v11)
          (pred_1 ?v13 ?v4) (pred_3 ?v9 ?v11)
                   (pred_2 ?v4 ?v11) (pred_11 ?v13) 
                   (pred_8 ?v4) (pred_5 ?v9))
:effect (and  (pred_12 ?v4) (not (pred_8 ?v4))))


(:action op_1
:parameters (?v13 ?v2)
:precondition (and (pred_6 ?v13) (pred_6 ?v2)
               (pred_11 ?v13) (pred_1 ?v13 ?v2) (pred_12 ?v2))
:effect (and (pred_11 ?v2) (not (pred_11 ?v13))))

(:action op_4
:parameters (?v13 ?v9)
:precondition (and (pred_6 ?v13) (pred_4 ?v9) 
                  (pred_11 ?v13) (pred_10 ?v9 ?v13) (pred_7 ))
:effect (and (pred_5 ?v9)
   (not (pred_10 ?v9 ?v13)) (not (pred_7 ))))


(:action op_5
:parameters (?v13 ?v3 ?v5)
:precondition (and (pred_6 ?v13) (pred_4 ?v3) (pred_4 ?v5)
                  (pred_11 ?v13) (pred_5 ?v5) (pred_10 ?v3 ?v13))
:effect (and (pred_5 ?v3) (pred_10 ?v5 ?v13)
        (not (pred_5 ?v5)) (not (pred_10 ?v3 ?v13))))

(:action op_3
:parameters (?v13 ?v9)
:precondition (and (pred_6 ?v13) (pred_4 ?v9) 
                  (pred_11 ?v13) (pred_5 ?v9))
:effect (and (pred_7 ) (pred_10 ?v9 ?v13) (not (pred_5 ?v9)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_07 obj_19 obj_13 obj_18 obj_14 obj_09 obj_06 obj_03 obj_16 obj_01 obj_04 obj_17 obj_21 obj_08 obj_15
    obj_10 obj_11
    obj_02 obj_12 obj_20
    )

    (:init
       (pred_7)

       (pred_6 obj_05)
       (pred_6 obj_07)
       (pred_6 obj_19)
       (pred_6 obj_13)
       (pred_6 obj_18)
       (pred_6 obj_14)
       (pred_6 obj_09)
       (pred_6 obj_06)
       (pred_6 obj_03)
       (pred_6 obj_16)
       (pred_6 obj_01)
       (pred_6 obj_04)
       (pred_6 obj_17)
       (pred_6 obj_21)
       (pred_6 obj_08)
       (pred_6 obj_15)
       (pred_9 obj_10)
       (pred_9 obj_11)
       (pred_4 obj_02)
       (pred_4 obj_12)
       (pred_4 obj_20)

       (pred_1 obj_05 obj_18)
       (pred_1 obj_05 obj_07)
       (pred_1 obj_07 obj_14)
       (pred_1 obj_07 obj_19)
       (pred_1 obj_07 obj_05)
       (pred_1 obj_19 obj_09)
       (pred_1 obj_19 obj_13)
       (pred_1 obj_19 obj_07)
       (pred_1 obj_13 obj_06)
       (pred_1 obj_13 obj_19)
       (pred_1 obj_18 obj_03)
       (pred_1 obj_18 obj_14)
       (pred_1 obj_18 obj_05)
       (pred_1 obj_14 obj_16)
       (pred_1 obj_14 obj_09)
       (pred_1 obj_14 obj_07)
       (pred_1 obj_14 obj_18)
       (pred_1 obj_09 obj_01)
       (pred_1 obj_09 obj_06)
       (pred_1 obj_09 obj_19)
       (pred_1 obj_09 obj_14)
       (pred_1 obj_06 obj_04)
       (pred_1 obj_06 obj_13)
       (pred_1 obj_06 obj_09)
       (pred_1 obj_03 obj_17)
       (pred_1 obj_03 obj_16)
       (pred_1 obj_03 obj_18)
       (pred_1 obj_16 obj_21)
       (pred_1 obj_16 obj_01)
       (pred_1 obj_16 obj_14)
       (pred_1 obj_16 obj_03)
       (pred_1 obj_01 obj_08)
       (pred_1 obj_01 obj_04)
       (pred_1 obj_01 obj_09)
       (pred_1 obj_01 obj_16)
       (pred_1 obj_04 obj_15)
       (pred_1 obj_04 obj_06)
       (pred_1 obj_04 obj_01)
       (pred_1 obj_17 obj_21)
       (pred_1 obj_17 obj_03)
       (pred_1 obj_21 obj_08)
       (pred_1 obj_21 obj_16)
       (pred_1 obj_21 obj_17)
       (pred_1 obj_08 obj_15)
       (pred_1 obj_08 obj_01)
       (pred_1 obj_08 obj_21)
       (pred_1 obj_15 obj_04)
       (pred_1 obj_15 obj_08)
       (pred_8 obj_05)
       (pred_8 obj_09)
       (pred_8 obj_08)
       (pred_2  obj_05 obj_10)
       (pred_2  obj_09 obj_11)
       (pred_2  obj_08 obj_10)
       (pred_12 obj_07)
       (pred_12 obj_19)
       (pred_12 obj_13)
       (pred_12 obj_18)
       (pred_12 obj_14)
       (pred_12 obj_06)
       (pred_12 obj_03)
       (pred_12 obj_16)
       (pred_12 obj_01)
       (pred_12 obj_04)
       (pred_12 obj_17)
       (pred_12 obj_21)
       (pred_12 obj_15)

       (pred_3  obj_02 obj_10)
       (pred_3  obj_12 obj_11)
       (pred_3  obj_20 obj_11)
       (pred_10 obj_02 obj_06)
       (pred_10 obj_12 obj_13)
       (pred_10 obj_20 obj_13)
       (pred_11 obj_07)
    )

    (:goal (and
       (pred_10 obj_02 obj_17)
       (pred_10 obj_12 obj_16)
    ))
(:constraints
  (always (not (pred_11 obj_04)))
)
)

; plan
1. (op_1 obj_07 obj_19)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_19)
   goals met: 0 of 2
2. (op_1 obj_19 obj_13)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_13)
   goals met: 0 of 2
3. (op_4 obj_13 obj_12)
   deleted: (pred_10 obj_12 obj_13) (pred_7)
   added: (pred_5 obj_12)
   goals met: 0 of 2
4. (op_1 obj_13 obj_06)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_06)
   goals met: 0 of 2
5. (op_2 obj_06 obj_09 obj_12 obj_11)
   deleted: (pred_8 obj_09)
   added: (pred_12 obj_09)
   goals met: 0 of 2
6. (op_1 obj_06 obj_09)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_09)
   goals met: 0 of 2
7. (op_1 obj_09 obj_01)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_01)
   goals met: 0 of 2
8. (op_1 obj_01 obj_16)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_16)
   goals met: 0 of 2
9. (op_3 obj_16 obj_12)
   deleted: (pred_5 obj_12)
   added: (pred_7) (pred_10 obj_12 obj_16)
   goals met: 1 of 2
10. (op_1 obj_16 obj_14)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_14)
   goals met: 1 of 2
11. (op_1 obj_14 obj_09)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_09)
   goals met: 1 of 2
12. (op_1 obj_09 obj_06)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_06)
   goals met: 1 of 2
13. (op_4 obj_06 obj_02)
   deleted: (pred_10 obj_02 obj_06) (pred_7)
   added: (pred_5 obj_02)
   goals met: 1 of 2
14. (op_1 obj_06 obj_09)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_09)
   goals met: 1 of 2
15. (op_1 obj_09 obj_14)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_14)
   goals met: 1 of 2
16. (op_1 obj_14 obj_18)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_18)
   goals met: 1 of 2
17. (op_1 obj_18 obj_03)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_03)
   goals met: 1 of 2
18. (op_1 obj_03 obj_17)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_17)
   goals met: 1 of 2
19. (op_3 obj_17 obj_02)
   deleted: (pred_5 obj_02)
   added: (pred_7) (pred_10 obj_02 obj_17)
   goals met: 2 of 2
